In [1]:
import pandas as pd

# Series

In [2]:
data = [1,2,3,4,5]

In [3]:
s = pd.Series(data)

In [4]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
index = ['Linha ' + str(i) for i in range(5)]

In [7]:
index

['Linha 0', 'Linha 1', 'Linha 2', 'Linha 3', 'Linha 4']

In [8]:
s = pd.Series(data = data, index = index)

In [9]:
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [11]:
data = {'Linha ' + str(i) : i + 1 for i in range(5)}

In [12]:
data

{'Linha 0': 1, 'Linha 1': 2, 'Linha 2': 3, 'Linha 3': 4, 'Linha 4': 5}

In [13]:
s = pd.Series(data)

In [14]:
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [15]:
s2 = s + 10

In [16]:
s2

Linha 0    11
Linha 1    12
Linha 2    13
Linha 3    14
Linha 4    15
dtype: int64

In [17]:
s3 = s + s2

In [18]:
s3

Linha 0    12
Linha 1    14
Linha 2    16
Linha 3    18
Linha 4    20
dtype: int64

# DataFrames

In [19]:
data = [[1,2,3],[4,5,6],[7,8,9]]

In [20]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [23]:
df1 = pd.DataFrame(data = data)

In [24]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [25]:
index = ['Linha ' + str(i) for i in range(3)]

In [26]:
index

['Linha 0', 'Linha 1', 'Linha 2']

In [27]:
df1 = pd.DataFrame(data = data, index = index)

In [28]:
df1

         0  1  2
Linha 0  1  2  3
Linha 1  4  5  6
Linha 2  7  8  9

In [29]:
columns = ['Coluna ' + str(i) for i in range(3)]

In [30]:
columns

['Coluna 0', 'Coluna 1', 'Coluna 2']

In [31]:
df1 = pd.DataFrame(data=data, index=index, columns=columns)

In [32]:
df1

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [35]:
data = {
    'Coluna 0': {'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
    'Coluna 1': {'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
    'Coluna 2': {'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}
}

In [36]:
data

{'Coluna 0': {'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
 'Coluna 1': {'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
 'Coluna 2': {'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}}

In [37]:
df2 = pd.DataFrame(data)

In [38]:
df2

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [39]:
data = [(1,2,3),(4,5,6),(7,8,9)]

In [40]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [41]:
df3 = pd.DataFrame(data=data, index=index, columns=columns)

In [42]:
df3

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [43]:
df1[df1 > 0] = 'A'

In [44]:
df1

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A

In [45]:
df2[df2 > 0] = 'B'

In [46]:
df2

        Coluna 0 Coluna 1 Coluna 2
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B

In [48]:
df3[df3 > 0] = 'C'

In [49]:
df3

        Coluna 0 Coluna 1 Coluna 2
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [50]:
df4 = pd.concat([df1, df2, df3])

In [51]:
df4

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [52]:
df4 = pd.concat([df1, df2, df3], axis=1)

In [53]:
df4

,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2
Linha 0,A,A,A,B,B,B,C,C,C
Linha 1,A,A,A,B,B,B,C,C,C
Linha 2,A,A,A,B,B,B,C,C,C